# 1
print('=================== 1 =================')
a = input('Введите приветствие: ')
if len(a) > 30:
    a = a[:30]
output = f'''
==============================
{a:^30}
==============================
'''
print(output)

# 2
print('=================== 2 =================')
a = int(input('Введите число:'))
b = int(input('Введите число:'))
c = int(input('Введите число:'))
if a > 0:
    a = a
else:
    a = 0
if b > 0:
    b = b
else:
    b = 0
if c > 0:
    c = c
else:
    c = 0
print('Сумма положительных чисел: ', a + b + c)

# 3
print('=================== 3 =================')
year = int(input('Введите год: '))
if year % 4 == 0:
    print('Да')
else:
    print('Нет')

# 4
print('=================== 4 =================')
x1y1 = input('Введите координаты первой клетки: ')
x2y2 = input('Введите координаты второй клетки: ')
if x1y1[0] == x2y2[0] or x1y1[1] == x2y2[1]:
    print('Да')
else:
    print('Нет')
